fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственныей</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
     	Возврат;
	КонецЕсли;
	
	Если ГрафикУжеСуществует() Тогда
		
		ТекстСообщения = СтрШаблон("Запись не возможна. На %1 год график уже существует.", Формат(Год,"ЧГ=0"));
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Год",,Отказ);
		Возврат;
				
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Инициализация набора записей
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Движения.ВКМ_ГрафикОтпусков.Очистить();
	
	// Подготовим таблицу для расчета дней в текущем документе
	ТаблицаДней = ОтпускаСотрудников.Выгрузить();
	ТаблицаДней.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	
	Для Каждого СтрокаТЧ Из ТаблицаДней Цикл
		
		// Расчет дней (Конец - Начало) / 86400 + 1
		ДнейВСтроке = (НачалоДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала)) / 86400 + 1;
		СтрокаТЧ.КоличествоДней = ДнейВСтроке;
		
		// Формируем движение в регистр сведений
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Сотрудник     = СтрокаТЧ.Сотрудник;
		Движение.ДатаНачала    = СтрокаТЧ.ДатаНачала;
		Движение.ДатаОкончания = СтрокаТЧ.ДатаОкончания;
		Движение.КоличествоДней    = ДнейВСтроке;
		
	КонецЦикла;
	
	// 2. ПРОВЕРКА НА ПЕРЕСЕЧЕНИЕ (чтобы не ходили толпой)
	// Мы сравним каждую строку документа со всеми остальными строками этого же документа
	Для Каждого ТекущаяСтрока Из ОтпускаСотрудников Цикл
		
		Для Каждого СтрокаДляСравнения Из ОтпускаСотрудников Цикл
			
			// Самих себя с собой не сравниваем
			Если ТекущаяСтрока.НомерСтроки = СтрокаДляСравнения.НомерСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем условие пересечения периодов
			// Если (Начало1 <= Конец2) И (Конец1 >= Начало2)
			Если (ТекущаяСтрока.ДатаНачала <= СтрокаДляСравнения.ДатаОкончания) 
				И (ТекущаяСтрока.ДатаОкончания >= СтрокаДляСравнения.ДатаНачала) Тогда
				
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Внимание! Отпуск сотрудника %1 пересекается с отпуском сотрудника %2 в периоде с %3 по %4!'"),
					ТекущаяСтрока.Сотрудник, 
					СтрокаДляСравнения.Сотрудник, 
					Формат(Макс(ТекущаяСтрока.ДатаНачала, СтрокаДляСравнения.ДатаНачала), "ДЛФ=D"),
					Формат(Мин(ТекущаяСтрока.ДатаОкончания, СтрокаДляСравнения.ДатаОкончания), "ДЛФ=D"));
				
				// Выводим сообщение. Если хочешь ЗАПРЕТИТЬ проведение — поставь Отказ = Истина.
				// Если хочешь просто ПРЕДУПРЕДИТЬ — не пиши Отказ = Истина.
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	// 3. Оптимизированная проверка лимита 28 дней (БЕЗ запроса в цикле)
	// Получаем список уникальных сотрудников из документа
	СписокСотрудников = ТаблицаДней.ВыгрузитьКолонку("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикОтпусков.КоличествоДней) КАК ВсегоДнейВБазе
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Сотрудник В (&СписокСотрудников)
		|	И ГОД(ВКМ_ГрафикОтпусков.ДатаНачала) = &Год
		|	И ВКМ_ГрафикОтпусков.Регистратор <> &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусков.Сотрудник";

	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Запрос.УстановитьПараметр("Год",               Год);
	Запрос.УстановитьПараметр("Ссылка",            Ссылка);
	
	// Выгружаем базу в таблицу для быстрого поиска
	ТаблицаБазы = Запрос.Выполнить().Выгрузить();
	ТаблицаБазы.Индексы.Добавить("Сотрудник");

	// Сворачиваем текущий документ, чтобы знать сумму дней по каждому человеку
	ТаблицаДней.Свернуть("Сотрудник", "КоличествоДней");

	Для Каждого СтрокаДок Из ТаблицаДней Цикл
		
		// Ищем, были ли отпуска в базе (других документах)
		СтрокаБазы = ТаблицаБазы.Найти(СтрокаДок.Сотрудник, "Сотрудник");
		ДнейВБазе = ?(СтрокаБазы = Неопределено, 0, СтрокаБазы.ВсегоДнейВБазе);
		
		Если (ДнейВБазе + СтрокаДок.КоличествоДней) > 28 Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У сотрудника %1 отпуск в документе более 28 дней за %2 год, перед проведением документа проверьте право на отпуск! (Уже есть: %3, в документе: %4)'"),
				СтрокаДок.Сотрудник, Формат(Год, "ЧГ=0"), ДнейВБазе, СтрокаДок.КоличествоДней);
			
			// Вывод ошибки через БСП
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Функция ГрафикУжеСуществует()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Год = &Год
		|	И ВКМ_ГрафикОтпусков.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();

КонецФункции

#КонецОбласти

#КонецЕсли
